In [1]:
"""INTRODUCTION TO DATAFRAMES"""

'INTRODUCTION TO DATAFRAMES'

In [3]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5, 4), index='a b c d e'.upper().split(), columns='w x y z'.upper().split())

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df['w'.upper()]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [12]:
df['x'.upper()]

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [13]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [14]:
df['new'] = df['W'] ** df['Y']

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  2.469814
B  0.651118 -0.319318 -0.848077  0.605965  1.438901
C -2.018168  0.740122  0.528813 -0.589001       NaN
D  0.188695 -0.758872 -0.933237  0.955057  4.741183
E  0.190794  1.978757  2.605967  0.683509  0.013341

In [16]:
df.drop('new', axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df['V'] = df['W'] * df['X'] * df['Y']

In [19]:
df

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  1.543785
B  0.651118 -0.319318 -0.848077  0.605965  0.176327
C -2.018168  0.740122  0.528813 -0.589001 -0.789884
D  0.188695 -0.758872 -0.933237  0.955057  0.133635
E  0.190794  1.978757  2.605967  0.683509  0.983846

In [21]:
df.drop('V', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.drop('V', axis=1, inplace=True)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [25]:
df.shape

(5, 4)

In [26]:
# selecting colums

df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [27]:
# or selecting multiple columns

df[['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
# selecting rows

df.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [30]:
type(df.loc['E'])

pandas.core.series.Series

In [32]:
df.iloc[-1]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [33]:
df.loc['B', 'Y']

-0.8480769834036315

In [34]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [38]:
df_countries = pd.DataFrame(index=['US', 'UK', 'ES', 'JP', 'CA'], 
                            columns=['Population', 'GDP', 'Military_Ranking', 'Location', 'Language'])

df_countries

   Population  GDP Military_Ranking Location Language
US        NaN  NaN              NaN      NaN      NaN
UK        NaN  NaN              NaN      NaN      NaN
ES        NaN  NaN              NaN      NaN      NaN
JP        NaN  NaN              NaN      NaN      NaN
CA        NaN  NaN              NaN      NaN      NaN

In [50]:
df_countries.loc['US']['Population'] = '332,278,200'

In [51]:
df_countries

     Population  GDP Military_Ranking Location Language
US  332,278,200  NaN              NaN      NaN      NaN
UK   67,886,004  NaN              NaN      NaN      NaN
ES          NaN  NaN              NaN      NaN      NaN
JP          NaN  NaN              NaN      NaN      NaN
CA          NaN  NaN              NaN      NaN      NaN

In [52]:
df_countries.loc['UK']['Population'] = '67,886,004'

In [53]:
df_countries

     Population  GDP Military_Ranking Location Language
US  332,278,200  NaN              NaN      NaN      NaN
UK   67,886,004  NaN              NaN      NaN      NaN
ES          NaN  NaN              NaN      NaN      NaN
JP          NaN  NaN              NaN      NaN      NaN
CA          NaN  NaN              NaN      NaN      NaN

In [54]:
df_countries.loc['ES']['Population'] = '47,431,256'

In [56]:
df_countries

     Population  GDP Military_Ranking Location Language
US  332,278,200  NaN              NaN      NaN      NaN
UK   67,886,004  NaN              NaN      NaN      NaN
ES   47,431,256  NaN              NaN      NaN      NaN
JP          NaN  NaN              NaN      NaN      NaN
CA          NaN  NaN              NaN      NaN      NaN

In [57]:
df_countries.loc['JP']['Population'] = '125,961,625'

In [58]:
df_countries

     Population  GDP Military_Ranking Location Language
US  332,278,200  NaN              NaN      NaN      NaN
UK   67,886,004  NaN              NaN      NaN      NaN
ES   47,431,256  NaN              NaN      NaN      NaN
JP  125,961,625  NaN              NaN      NaN      NaN
CA          NaN  NaN              NaN      NaN      NaN

In [59]:
df_countries.loc['CA']['Population'] = '37,894,799'

In [60]:
df_countries

     Population  GDP Military_Ranking Location Language
US  332,278,200  NaN              NaN      NaN      NaN
UK   67,886,004  NaN              NaN      NaN      NaN
ES   47,431,256  NaN              NaN      NaN      NaN
JP  125,961,625  NaN              NaN      NaN      NaN
CA   37,894,799  NaN              NaN      NaN      NaN

In [61]:
df_countries.loc['CA']['Language'] = 'English and French'

In [62]:
df_countries

     Population  GDP Military_Ranking Location            Language
US  332,278,200  NaN              NaN      NaN                 NaN
UK   67,886,004  NaN              NaN      NaN                 NaN
ES   47,431,256  NaN              NaN      NaN                 NaN
JP  125,961,625  NaN              NaN      NaN                 NaN
CA   37,894,799  NaN              NaN      NaN  English and French

In [63]:
df_countries.loc['UK']['Language'] = 'English'

In [64]:
df_countries.loc['US']['Language'] = 'English'

In [65]:
df_countries.loc['ES']['Language'] = 'Spanish'

In [66]:
df_countries

     Population  GDP Military_Ranking Location            Language
US  332,278,200  NaN              NaN      NaN             English
UK   67,886,004  NaN              NaN      NaN             English
ES   47,431,256  NaN              NaN      NaN             Spanish
JP  125,961,625  NaN              NaN      NaN                 NaN
CA   37,894,799  NaN              NaN      NaN  English and French

In [67]:
df_countries.loc['JP']['Language'] = 'Japanese'

In [68]:
df_countries

     Population  GDP Military_Ranking Location            Language
US  332,278,200  NaN              NaN      NaN             English
UK   67,886,004  NaN              NaN      NaN             English
ES   47,431,256  NaN              NaN      NaN             Spanish
JP  125,961,625  NaN              NaN      NaN            Japanese
CA   37,894,799  NaN              NaN      NaN  English and French

In [69]:
df_countries.loc['JP']['Location'] = 'Southeast Asia'

In [70]:
df_countries

     Population  GDP Military_Ranking        Location            Language
US  332,278,200  NaN              NaN             NaN             English
UK   67,886,004  NaN              NaN             NaN             English
ES   47,431,256  NaN              NaN             NaN             Spanish
JP  125,961,625  NaN              NaN  Southeast Asia            Japanese
CA   37,894,799  NaN              NaN             NaN  English and French

In [71]:
df_countries.loc['US']['Location'] = 'North America'

In [72]:
df_countries.loc['UK']['Location'] = 'Northern Europe'

In [73]:
df_countries.loc['ES']['Location'] = 'Western Europe'

In [74]:
df_countries.loc['CA']['Location'] = 'North America'

In [75]:
df_countries

     Population  GDP Military_Ranking         Location            Language
US  332,278,200  NaN              NaN    North America             English
UK   67,886,004  NaN              NaN  Northern Europe             English
ES   47,431,256  NaN              NaN   Western Europe             Spanish
JP  125,961,625  NaN              NaN   Southeast Asia            Japanese
CA   37,894,799  NaN              NaN    North America  English and French

In [80]:
df_countries.drop('Military_Ranking', axis=1)

     Population  GDP         Location            Language
US  332,278,200  NaN    North America             English
UK   67,886,004  NaN  Northern Europe             English
ES   47,431,256  NaN   Western Europe             Spanish
JP  125,961,625  NaN   Southeast Asia            Japanese
CA   37,894,799  NaN    North America  English and French

In [81]:
df_countries.drop('Military_Ranking', axis=1, inplace=True)

In [82]:
df_countries

     Population  GDP         Location            Language
US  332,278,200  NaN    North America             English
UK   67,886,004  NaN  Northern Europe             English
ES   47,431,256  NaN   Western Europe             Spanish
JP  125,961,625  NaN   Southeast Asia            Japanese
CA   37,894,799  NaN    North America  English and French

In [83]:
df_countries.drop('GDP', axis=1, inplace=True)

In [84]:
df_countries

     Population         Location            Language
US  332,278,200    North America             English
UK   67,886,004  Northern Europe             English
ES   47,431,256   Western Europe             Spanish
JP  125,961,625   Southeast Asia            Japanese
CA   37,894,799    North America  English and French

In [85]:
df_countries = df_countries.to_csv('country_data.csv', encoding='utf-8')

In [87]:
countries_file = pd.read_csv('country_data.csv')

In [89]:
countries_file

  Unnamed: 0   Population         Location            Language
0         US  332,278,200    North America             English
1         UK   67,886,004  Northern Europe             English
2         ES   47,431,256   Western Europe             Spanish
3         JP  125,961,625   Southeast Asia            Japanese
4         CA   37,894,799    North America  English and French

In [90]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
# conditional selection

In [92]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [93]:
booldf = df > 0

In [94]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df_countries

  Unnamed: 0   Population         Location            Language
0         US  332,278,200    North America             English
1         UK   67,886,004  Northern Europe             English
2         ES   47,431,256   Western Europe             Spanish
3         JP  125,961,625   Southeast Asia            Japanese
4         CA   37,894,799    North America  English and French

In [104]:
df_countries['Population']

0    332,278,200
1     67,886,004
2     47,431,256
3    125,961,625
4     37,894,799
Name: Population, dtype: object

In [107]:
df_countries.iloc[0:2]

  Unnamed: 0   Population         Location Language
0         US  332,278,200    North America  English
1         UK   67,886,004  Northern Europe  English

In [109]:
df_countries

  Unnamed: 0   Population         Location            Language
0         US  332,278,200    North America             English
1         UK   67,886,004  Northern Europe             English
2         ES   47,431,256   Western Europe             Spanish
3         JP  125,961,625   Southeast Asia            Japanese
4         CA   37,894,799    North America  English and French

In [113]:
df_countries['Unnamed: 0'] = 'Country_Name'

In [114]:
df_countries

     Unnamed: 0   Population         Location            Language
0  Country_Name  332,278,200    North America             English
1  Country_Name   67,886,004  Northern Europe             English
2  Country_Name   47,431,256   Western Europe             Spanish
3  Country_Name  125,961,625   Southeast Asia            Japanese
4  Country_Name   37,894,799    North America  English and French

In [116]:
df_countries['Unnamed: 0'][0] = 'United States'

In [117]:
df_countries

      Unnamed: 0   Population         Location            Language
0  United States  332,278,200    North America             English
1   Country_Name   67,886,004  Northern Europe             English
2   Country_Name   47,431,256   Western Europe             Spanish
3   Country_Name  125,961,625   Southeast Asia            Japanese
4   Country_Name   37,894,799    North America  English and French

In [118]:
df_countries['Unnamed: 0'][1] = 'United Kingdom'

In [119]:
df_countries

       Unnamed: 0   Population         Location            Language
0   United States  332,278,200    North America             English
1  United Kingdom   67,886,004  Northern Europe             English
2    Country_Name   47,431,256   Western Europe             Spanish
3    Country_Name  125,961,625   Southeast Asia            Japanese
4    Country_Name   37,894,799    North America  English and French

In [120]:
df_countries['Unnamed: 0'][2] = 'Spain'

In [121]:
df_countries['Unnamed: 0'][3] = 'Japan'

In [122]:
df_countries['Unnamed: 0'][4] = 'Canada'

In [123]:
df_countries

       Unnamed: 0   Population         Location            Language
0   United States  332,278,200    North America             English
1  United Kingdom   67,886,004  Northern Europe             English
2           Spain   47,431,256   Western Europe             Spanish
3           Japan  125,961,625   Southeast Asia            Japanese
4          Canada   37,894,799    North America  English and French

In [124]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
df[df['W'] > 0][['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [133]:
df[df['Z'] > 0][['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
D  0.188695 -0.758872
E  0.190794  1.978757

In [130]:
bool_series = df['W'] > 0
result = df[bool_series]
mycols = ['Y', 'Z']
result[mycols]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [134]:
True and True

True

In [135]:
False and True

False

In [136]:
# multiple conditions & = and, | = or

In [137]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
df[(df['X'] > 0) & (df['Z'] < 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [141]:
df[(df['X'] > 0) | (df['Z'] < 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [143]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [144]:
df_countries

       Unnamed: 0   Population         Location            Language
0   United States  332,278,200    North America             English
1  United Kingdom   67,886,004  Northern Europe             English
2           Spain   47,431,256   Western Europe             Spanish
3           Japan  125,961,625   Southeast Asia            Japanese
4          Canada   37,894,799    North America  English and French

In [145]:
df_countries_copy = df_countries.copy()

In [146]:
df_countries_copy

       Unnamed: 0   Population         Location            Language
0   United States  332,278,200    North America             English
1  United Kingdom   67,886,004  Northern Europe             English
2           Spain   47,431,256   Western Europe             Spanish
3           Japan  125,961,625   Southeast Asia            Japanese
4          Canada   37,894,799    North America  English and French

In [148]:
df_countries_copy.reset_index(inplace=True)

In [149]:
df_countries_copy

   index      Unnamed: 0   Population         Location            Language
0      0   United States  332,278,200    North America             English
1      1  United Kingdom   67,886,004  Northern Europe             English
2      2           Spain   47,431,256   Western Europe             Spanish
3      3           Japan  125,961,625   Southeast Asia            Japanese
4      4          Canada   37,894,799    North America  English and French

In [150]:
new_index = 'US UK ES JP CA'.split()

In [151]:
df_countries_copy['Countries'] = new_index

In [152]:
df_countries_copy

,index,Unnamed: 0,Population,Location,Language,Countries
0,0,United States,"332,278,200",North America,English,US
1,1,United Kingdom,"67,886,004",Northern Europe,English,UK
2,2,Spain,"47,431,256",Western Europe,Spanish,ES
3,3,Japan,"125,961,625",Southeast Asia,Japanese,JP
4,4,Canada,"37,894,799",North America,English and French,CA

In [155]:
df_countries_copy.set_index('Countries', inplace=True)

In [156]:
df_countries_copy

,index,Unnamed: 0,Population,Location,Language
Countries,,,,,
US,0,United States,"332,278,200",North America,English
UK,1,United Kingdom,"67,886,004",Northern Europe,English
ES,2,Spain,"47,431,256",Western Europe,Spanish
JP,3,Japan,"125,961,625",Southeast Asia,Japanese
CA,4,Canada,"37,894,799",North America,English and French

In [158]:
df_countries_copy.loc['US']

index                     0
Unnamed: 0    United States
Population      332,278,200
Location      North America
Language            English
Name: US, dtype: object

In [159]:
df_countries_copy.loc['UK']

index                       1
Unnamed: 0     United Kingdom
Population         67,886,004
Location      Northern Europe
Language              English
Name: UK, dtype: object

In [160]:
df_countries_copy.loc['CA']

index                          4
Unnamed: 0                Canada
Population            37,894,799
Location           North America
Language      English and French
Name: CA, dtype: object

In [161]:
# multi index and multilevel index

In [162]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [163]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [164]:
inside

[1, 2, 3, 1, 2, 3]

In [166]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [167]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [168]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [169]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [171]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [172]:
df

             A         B
G1 1  1.862864 -1.133817
   2  0.610478  0.386030
   3  2.084019 -0.376519
G2 1  0.230336  0.681209
   2  1.035125 -0.031160
   3  1.939932 -1.005187

In [173]:
# how to call data

In [174]:
df.loc['G1']

          A         B
1  1.862864 -1.133817
2  0.610478  0.386030
3  2.084019 -0.376519

In [175]:
df.loc['G1'].loc[1]

A    1.862864
B   -1.133817
Name: 1, dtype: float64

In [177]:
df.index.names

FrozenList([None, None])

In [178]:
df

             A         B
G1 1  1.862864 -1.133817
   2  0.610478  0.386030
   3  2.084019 -0.376519
G2 1  0.230336  0.681209
   2  1.035125 -0.031160
   3  1.939932 -1.005187

In [181]:
df.xs('G1')

          A         B
1  1.862864 -1.133817
2  0.610478  0.386030
3  2.084019 -0.376519

In [182]:
df.xs(['G1', 1])

<ipython-input-182-2ccdcc92ea1c>:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1', 1])

A    1.862864
B   -1.133817
Name: (G1, 1), dtype: float64

In [183]:
df.index.names = ['Groups', 'Num']

In [184]:
df

                   A         B
Groups Num
G1     1    1.862864 -1.133817
       2    0.610478  0.386030
       3    2.084019 -0.376519
G2     1    0.230336  0.681209
       2    1.035125 -0.031160
       3    1.939932 -1.005187

In [185]:
df_countries_copy

,index,Unnamed: 0,Population,Location,Language
Countries,,,,,
US,0,United States,"332,278,200",North America,English
UK,1,United Kingdom,"67,886,004",Northern Europe,English
ES,2,Spain,"47,431,256",Western Europe,Spanish
JP,3,Japan,"125,961,625",Southeast Asia,Japanese
CA,4,Canada,"37,894,799",North America,English and French

In [190]:
df_countries_copy.index.names = ['Country']

In [191]:
df_countries_copy

,index,Unnamed: 0,Population,Location,Language
Country,,,,,
US,0,United States,"332,278,200",North America,English
UK,1,United Kingdom,"67,886,004",Northern Europe,English
ES,2,Spain,"47,431,256",Western Europe,Spanish
JP,3,Japan,"125,961,625",Southeast Asia,Japanese
CA,4,Canada,"37,894,799",North America,English and French

In [192]:
df

                   A         B
Groups Num
G1     1    1.862864 -1.133817
       2    0.610478  0.386030
       3    2.084019 -0.376519
G2     1    0.230336  0.681209
       2    1.035125 -0.031160
       3    1.939932 -1.005187

In [194]:
df.loc['G2'].loc[2]['B']

-0.031160481493099617

In [198]:
df.loc['G1'].loc[1]['B']

-1.1338171615837889

In [199]:
df.loc['G2'].loc[3]['A']

1.9399323109926203

In [200]:
# xs = cross section

In [201]:
df.xs('G1')

            A         B
Num
1    1.862864 -1.133817
2    0.610478  0.386030
3    2.084019 -0.376519

In [203]:
df.xs(2, level='Num')

               A        B
Groups
G1      0.610478  0.38603
G2      1.035125 -0.03116